app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes"  ORDER BY "recipes"."id" DESC LIMIT 1
---
  def meal
    @recipe = Recipe.last

SELECT "recipes".* FROM "recipes"
SELECT "recipes".* FROM "recipes"  ORDER BY "recipes"."preptime" ASC
---
  def index
    @recipes = Recipe.all

    if params[:sort]
      @recipes = Recipe.order(:preptime)

INSERT INTO "recipes" ("title", "chef", "ingredients", "directions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bread"], ["chef", "Me"], ["ingredients", "Bread"], ["directions", "Toast"], ["created_at", "2016-01-17 20:52:39.871260"], ["updated_at", "2016-01-17 20:52:39.871260"]]
---
  def create
    @recipe = Recipe.create( {title: params[:title],
                              chef: params[:chef],
                              ingredients: params[:ingredients],
                              directions: params[:directions],
                              image: params[:image], preptime: params[:preptime]
                              })

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    @recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "recipes" SET "image" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image", "http://38.media.tumblr.com/a8ffa70a48416a164574370e98944424/tumblr_inline_n3d2aiUBd51qc9grt.jpg"], ["updated_at", "2016-01-20 16:32:24.548809"], ["id", 22]]
---
  def update
    @recipe = Recipe.find_by(id: params[:id])

    @recipe.update({
                              title: params[:title],
                              chef: params[:chef],
                              ingredients: params[:ingredients],
                              directions: params[:directions],
                              image: params[:image], preptime: params[:preptime]

      })

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 8]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy